MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C31C0AGN20000/mcu.h
/*******************************************************************************
* \file		s6e1c3xc.h
* 
* \version  1.0
*
* \2026-01-06		7/29/2016
*
* \brief	CMSIS Core Peripheral Access Layer Header File for s6e1c3xc Device
*
********************************************************************************
* Copyright 2016, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
* CYPRESS PROVIDES THIS SOFTWARE "AS IS" AND MAKES NO WARRANTY
* OF ANY KIND, EXPRESS OR IMPLIED, WITH REGARD TO THIS SOFTWARE,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
* MERCHANTABILITY, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR
* PURPOSE.
*******************************************************************************/

#ifndef _S6E1C3XC_H_
#define _S6E1C3XC_H_
#define __S6E1C3XC_H__
#define __S6E1C3_H__

#if defined __cplusplus
extern "C" {
#endif

#define FM_GENERAL_MCUHEADER_VERSION              0201


#ifndef FM_DEVICE_PACKAGE_S6E_C
#define FM_DEVICE_PACKAGE_S6E_C
#endif 

/*******************************************************************************
* Configuration of the Cortex-M4 Processor and Core Peripherals
*******************************************************************************/
#define FM0P_DEVICE_TYPE                          3
#define FM_DEVICE_TYPE                            0103u
#define FM_CORE_TYPE_FM0P                         1
#define __CM0PLUS_REV                             0x0001
#define __MPU_PRESENT                             0
#define __NVIC_PRIO_BITS                          2
#define __Vendor_SysTickConfig                    0
#define __FPU_PRESENT                             0
#define __FPU_DP                                  0
#define __ICACHE_PRESENT                          0
#define __DCACHE_PRESENT                          0
#define __DTCM_PRESENT                            0

/*******************************************************************************
* Peripheral Types
*******************************************************************************/
#define FM0P_ADC_TYPE_A                           1
#define FM0P_BT_TYPE_A                            1
#define FM0P_BTIOSEL03_TYPE_A                     1
#define FM0P_BTIOSEL47_TYPE_A                     1
#define FM0P_CLK_GATING_TYPE_A                    1
#define FM0P_CRC_TYPE_A                           1
#define FM0P_CRG_TYPE_A                           1
#define FM0P_CRTRIM_TYPE_B                        1
#define FM0P_DS_TYPE_C                            1
#define FM0P_DSTC_TYPE_B                          1
#define FM0P_DT_TYPE_A                            1
#define FM0P_EXTI_TYPE_B                          1
#define FM0P_FASTIO_TYPE_A                        1
#define FM0P_FLASH_IF_TYPE_C                      1
#define FM0P_GPIO_TYPE_C                          1
#define FM0P_HDMICEC_TYPE_A                       1
#define FM0P_HWWDT_TYPE_A                         1
#define FM0P_I2CSLAVE_TYPE_A                      1
#define FM0P_INTREQ_TYPE_3                        1
#define FM0P_LSCRP_TYPE_A                         1
#define FM0P_LVD_TYPE_C                           1
#define FM0P_MFS_TYPE_A                           1
#define FM0P_MFSI2S_TYPE_A                        1
#define FM0P_MTB_DWT_TYPE_A                       1
#define FM0P_RTC_TYPE_A                           1
#define FM0P_SBSSR_TYPE_A                         1
#define FM0P_SMCIF_TYPE_A                         1
#define FM0P_SWWDT_TYPE_A                         1
#define FM0P_UNIQUE_ID_TYPE_A                     1
#define FM0P_USB_TYPE_A                           1
#define FM0P_USBCLK_TYPE_B                        1
#define FM0P_VIR_TYPE_A                           1
#define FM0P_WC_TYPE_A                            1

/*******************************************************************************
* Available Peripherals
*******************************************************************************/
#define FM0P_ADC_AVAILABLE                        1
#define FM_ADC_AVAILABLE                          1
#define FM0P_BT_AVAILABLE                         1
#define FM_BT_AVAILABLE                           1
#define FM0P_BT_PPG_AVAILABLE                     1
#define FM_BT_PPG_AVAILABLE                       1
#define FM0P_BT_PWC_AVAILABLE                     1
#define FM_BT_PWC_AVAILABLE                       1
#define FM0P_BT_PWM_AVAILABLE                     1
#define FM_BT_PWM_AVAILABLE                       1
#define FM0P_BT_RT_AVAILABLE                      1
#define FM_BT_RT_AVAILABLE                        1
#define FM0P_BTIOSEL03_AVAILABLE                  1
#define FM_BTIOSEL03_AVAILABLE                    1
#define FM0P_BTIOSEL47_AVAILABLE                  1
#define FM_BTIOSEL47_AVAILABLE                    1
#define FM0P_CLK_GATING_AVAILABLE                 1
#define FM_CLK_GATING_AVAILABLE                   1
#define FM0P_CRC_AVAILABLE                        1
#define FM_CRC_AVAILABLE                          1
#define FM0P_CRG_AVAILABLE                        1
#define FM_CRG_AVAILABLE                          1
#define FM0P_CRTRIM_AVAILABLE                     1
#define FM_CRTRIM_AVAILABLE                       1
#define FM0P_DS_AVAILABLE                         1
#define FM_DS_AVAILABLE                           1
#define FM0P_DSTC_AVAILABLE                       1
#define FM_DSTC_AVAILABLE                         1
#define FM0P_DT_AVAILABLE                         1
#define FM_DT_AVAILABLE                           1
#define FM0P_EXTI_AVAILABLE                       1
#define FM_EXTI_AVAILABLE                         1
#define FM0P_FASTIO_AVAILABLE                     1
#define FM_FASTIO_AVAILABLE                       1
#define FM0P_FLASH_IF_AVAILABLE                   1
#define FM_FLASH_IF_AVAILABLE                     1
#define FM0P_GPIO_AVAILABLE                       1
#define FM_GPIO_AVAILABLE                         1
#define FM0P_HDMICEC_AVAILABLE                    1
#define FM_HDMICEC_AVAILABLE                      1
#define FM0P_HWWDT_AVAILABLE                      1
#define FM_HWWDT_AVAILABLE                        1
#define FM0P_I2CSLAVE_AVAILABLE                   1
#define FM_I2CSLAVE_AVAILABLE                     1
#define FM0P_INTREQ_AVAILABLE                     1
#define FM_INTREQ_AVAILABLE                       1
#define FM0P_LSCRP_AVAILABLE                      1
#define FM_LSCRP_AVAILABLE                        1
#define FM0P_LVD_AVAILABLE                        1
#define FM_LVD_AVAILABLE                          1
#define FM0P_MFS_AVAILABLE                        1
#define FM_MFS_AVAILABLE                          1
#define FM0P_MFS_CSIO_AVAILABLE                   1
#define FM_MFS_CSIO_AVAILABLE                     1
#define FM0P_MFS_I2C_AVAILABLE                    1
#define FM_MFS_I2C_AVAILABLE                      1
#define FM0P_MFS_I2S_AVAILABLE                    1
#define FM_MFS_I2S_AVAILABLE                      1
#define FM0P_MFS_LIN_AVAILABLE                    1
#define FM_MFS_LIN_AVAILABLE                      1
#define FM0P_MFS_UART_AVAILABLE                   1
#define FM_MFS_UART_AVAILABLE                     1
#define FM0P_MFSI2S_AVAILABLE                     1
#define FM_MFSI2S_AVAILABLE                       1
#define FM0P_MTB_DWT_AVAILABLE                    1
#define FM_MTB_DWT_AVAILABLE                      1
#define FM0P_RTC_AVAILABLE                        1
#define FM_RTC_AVAILABLE                          1
#define FM0P_SBSSR_AVAILABLE                      1
#define FM_SBSSR_AVAILABLE                        1
#define FM0P_SMCIF_AVAILABLE                      1
#define FM_SMCIF_AVAILABLE                        1
#define FM0P_SWWDT_AVAILABLE                      1
#define FM_SWWDT_AVAILABLE                        1
#define FM0P_UNIQUE_ID_AVAILABLE                  1
#define FM_UNIQUE_ID_AVAILABLE                    1
#define FM0P_USB_AVAILABLE                        1
#define FM_USB_AVAILABLE                          1
#define FM0P_USBCLK_AVAILABLE                     1
#define FM_USBCLK_AVAILABLE                       1
#define FM0P_VIR_AVAILABLE                        1
#define FM_VIR_AVAILABLE                          1
#define FM0P_WC_AVAILABLE                         1
#define FM_WC_AVAILABLE                           1

