MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C31C0AGN20000/mcu.h
/*******************************************************************************
* SBSSR Registers SBSSR
*   Register Definition
*******************************************************************************/
#define FM_SBSSR_BTSSSR                           *((volatile uint16_t*)(0x40025FFCUL))
#define FM0P_SBSSR_BTSSSR                         *((volatile uint16_t*)(0x40025FFCUL))

/*******************************************************************************
* SMCIF Registers SMCIF1
*   Register Definition
*******************************************************************************/
#define FM_SMCIF1_GLOBALCONTROL1                  *((volatile uint16_t*)(0x4003C980UL))
#define FM0P_SMCIF1_GLOBALCONTROL1                *((volatile uint16_t*)(0x4003C980UL))
#define FM_SMCIF1_STATUS                          *((volatile uint16_t*)(0x4003C984UL))
#define FM0P_SMCIF1_STATUS                        *((volatile uint16_t*)(0x4003C984UL))
#define FM_SMCIF1_PORTCONTROL                     *((volatile uint16_t*)(0x4003C988UL))
#define FM0P_SMCIF1_PORTCONTROL                   *((volatile uint16_t*)(0x4003C988UL))
#define FM_SMCIF1_DATA                            *((volatile uint16_t*)(0x4003C98CUL))
#define FM0P_SMCIF1_DATA                          *((volatile uint16_t*)(0x4003C98CUL))
#define FM_SMCIF1_CARDCLOCK                       *((volatile uint16_t*)(0x4003C990UL))
#define FM0P_SMCIF1_CARDCLOCK                     *((volatile uint16_t*)(0x4003C990UL))
#define FM_SMCIF1_BAUDRATE                        *((volatile uint16_t*)(0x4003C994UL))
#define FM0P_SMCIF1_BAUDRATE                      *((volatile uint16_t*)(0x4003C994UL))
#define FM_SMCIF1_GUARDTIMER                      *((volatile uint16_t*)(0x4003C998UL))
#define FM0P_SMCIF1_GUARDTIMER                    *((volatile uint16_t*)(0x4003C998UL))
#define FM_SMCIF1_IDLETIMER                       *((volatile uint16_t*)(0x4003C99CUL))
#define FM0P_SMCIF1_IDLETIMER                     *((volatile uint16_t*)(0x4003C99CUL))
#define FM_SMCIF1_GLOBALCONTROL2                  *((volatile uint16_t*)(0x4003C9A0UL))
#define FM0P_SMCIF1_GLOBALCONTROL2                *((volatile uint16_t*)(0x4003C9A0UL))
#define FM_SMCIF1_DATA_FIFO                       *((volatile uint16_t*)(0x4003C9A4UL))
#define FM0P_SMCIF1_DATA_FIFO                     *((volatile uint16_t*)(0x4003C9A4UL))
#define FM_SMCIF1_FIFO_LEVEL_READ                 *((volatile uint16_t*)(0x4003C9A8UL))
#define FM0P_SMCIF1_FIFO_LEVEL_READ               *((volatile uint16_t*)(0x4003C9A8UL))
#define FM_SMCIF1_FIFO_LEVEL_WRITE                *((volatile uint16_t*)(0x4003C9ACUL))
#define FM0P_SMCIF1_FIFO_LEVEL_WRITE              *((volatile uint16_t*)(0x4003C9ACUL))
#define FM_SMCIF1_FIFO_MODE                       *((volatile uint16_t*)(0x4003C9B0UL))
#define FM0P_SMCIF1_FIFO_MODE                     *((volatile uint16_t*)(0x4003C9B0UL))
#define FM_SMCIF1_FIFO_CLEAR_MSB_WRITE            *((volatile uint16_t*)(0x4003C9B4UL))
#define FM0P_SMCIF1_FIFO_CLEAR_MSB_WRITE          *((volatile uint16_t*)(0x4003C9B4UL))
#define FM_SMCIF1_FIFO_CLEAR_MSB_READ             *((volatile uint16_t*)(0x4003C9B8UL))
#define FM0P_SMCIF1_FIFO_CLEAR_MSB_READ           *((volatile uint16_t*)(0x4003C9B8UL))
#define FM_SMCIF1_IRQ_STATUS                      *((volatile uint16_t*)(0x4003C9C0UL))
#define FM0P_SMCIF1_IRQ_STATUS                    *((volatile uint16_t*)(0x4003C9C0UL))

/*******************************************************************************
* SWWDT Registers SWWDT
*   Register Definition
*******************************************************************************/
#define FM_SWWDT_WDOGLOAD                         *((volatile uint32_t*)(0x40012000UL))
#define FM0P_SWWDT_WDOGLOAD                       *((volatile uint32_t*)(0x40012000UL))
#define FM_SWWDT_WDOGVALUE                        *((volatile uint32_t*)(0x40012004UL))
#define FM0P_SWWDT_WDOGVALUE                      *((volatile uint32_t*)(0x40012004UL))
#define FM_SWWDT_WDOGCONTROL                      *((volatile uint32_t*)(0x40012008UL))
#define FM0P_SWWDT_WDOGCONTROL                    *((volatile uint32_t*)(0x40012008UL))
#define FM_SWWDT_WDOGINTCLR                       *((volatile uint32_t*)(0x4001200CUL))
#define FM0P_SWWDT_WDOGINTCLR                     *((volatile uint32_t*)(0x4001200CUL))
#define FM_SWWDT_WDOGRIS                          *((volatile uint32_t*)(0x40012010UL))
#define FM0P_SWWDT_WDOGRIS                        *((volatile uint32_t*)(0x40012010UL))
#define FM_SWWDT_WDOGSPMC                         *((volatile uint32_t*)(0x40012018UL))
#define FM0P_SWWDT_WDOGSPMC                       *((volatile uint32_t*)(0x40012018UL))
#define FM_SWWDT_WDOGLOCK                         *((volatile uint32_t*)(0x40012C00UL))
#define FM0P_SWWDT_WDOGLOCK                       *((volatile uint32_t*)(0x40012C00UL))

/*******************************************************************************
* UNIQUE_ID Registers UNIQUE_ID
*   Register Definition
*******************************************************************************/
#define FM_UNIQUE_ID_UIDR0                        *((volatile uint32_t*)(0x40000200UL))
#define FM0P_UNIQUE_ID_UIDR0                      *((volatile uint32_t*)(0x40000200UL))
#define FM_UNIQUE_ID_UIDR1                        *((volatile uint32_t*)(0x40000204UL))
#define FM0P_UNIQUE_ID_UIDR1                      *((volatile uint32_t*)(0x40000204UL))

/*******************************************************************************
* USB Registers USB0
*   Register Definition
*******************************************************************************/
#define FM_USB0_HCNT                              *((volatile uint16_t*)(0x40042100UL))
#define FM0P_USB0_HCNT                            *((volatile uint16_t*)(0x40042100UL))
#define FM_USB0_HIRQ                              *((volatile  uint8_t*)(0x40042104UL))
#define FM0P_USB0_HIRQ                            *((volatile  uint8_t*)(0x40042104UL))
#define FM_USB0_HERR                              *((volatile  uint8_t*)(0x40042105UL))
#define FM0P_USB0_HERR                            *((volatile  uint8_t*)(0x40042105UL))
#define FM_USB0_HSTATE                            *((volatile  uint8_t*)(0x40042108UL))
#define FM0P_USB0_HSTATE                          *((volatile  uint8_t*)(0x40042108UL))
#define FM_USB0_HFCOMP                            *((volatile  uint8_t*)(0x40042109UL))
#define FM0P_USB0_HFCOMP                          *((volatile  uint8_t*)(0x40042109UL))
#define FM_USB0_HRTIMER                           *((volatile uint16_t*)(0x4004210CUL))
#define FM0P_USB0_HRTIMER                         *((volatile uint16_t*)(0x4004210CUL))
#define FM_USB0_HRTIMER2                          *((volatile  uint8_t*)(0x40042110UL))
#define FM0P_USB0_HRTIMER2                        *((volatile  uint8_t*)(0x40042110UL))
#define FM_USB0_HADR                              *((volatile  uint8_t*)(0x40042111UL))
#define FM0P_USB0_HADR                            *((volatile  uint8_t*)(0x40042111UL))
#define FM_USB0_HEOF                              *((volatile uint16_t*)(0x40042114UL))
#define FM0P_USB0_HEOF                            *((volatile uint16_t*)(0x40042114UL))
#define FM_USB0_HFRAME                            *((volatile uint16_t*)(0x40042118UL))
#define FM0P_USB0_HFRAME                          *((volatile uint16_t*)(0x40042118UL))
#define FM_USB0_HTOKEN                            *((volatile  uint8_t*)(0x4004211CUL))
#define FM0P_USB0_HTOKEN                          *((volatile  uint8_t*)(0x4004211CUL))
#define FM_USB0_UDCC                              *((volatile uint16_t*)(0x40042120UL))
#define FM0P_USB0_UDCC                            *((volatile uint16_t*)(0x40042120UL))
#define FM_USB0_EP0C                              *((volatile uint16_t*)(0x40042124UL))
#define FM0P_USB0_EP0C                            *((volatile uint16_t*)(0x40042124UL))
#define FM_USB0_EP1C                              *((volatile uint16_t*)(0x40042128UL))
#define FM0P_USB0_EP1C                            *((volatile uint16_t*)(0x40042128UL))
#define FM_USB0_EP2C                              *((volatile uint16_t*)(0x4004212CUL))
#define FM0P_USB0_EP2C                            *((volatile uint16_t*)(0x4004212CUL))
#define FM_USB0_EP3C                              *((volatile uint16_t*)(0x40042130UL))
#define FM0P_USB0_EP3C                            *((volatile uint16_t*)(0x40042130UL))
#define FM_USB0_EP4C                              *((volatile uint16_t*)(0x40042134UL))
#define FM0P_USB0_EP4C                            *((volatile uint16_t*)(0x40042134UL))
#define FM_USB0_EP5C                              *((volatile uint16_t*)(0x40042138UL))
#define FM0P_USB0_EP5C                            *((volatile uint16_t*)(0x40042138UL))
#define FM_USB0_TMSP                              *((volatile uint16_t*)(0x4004213CUL))
#define FM0P_USB0_TMSP                            *((volatile uint16_t*)(0x4004213CUL))
#define FM_USB0_UDCS                              *((volatile  uint8_t*)(0x40042140UL))
#define FM0P_USB0_UDCS                            *((volatile  uint8_t*)(0x40042140UL))
#define FM_USB0_UDCIE                             *((volatile  uint8_t*)(0x40042141UL))
#define FM0P_USB0_UDCIE                           *((volatile  uint8_t*)(0x40042141UL))
#define FM_USB0_EP0IS                             *((volatile uint16_t*)(0x40042144UL))
#define FM0P_USB0_EP0IS                           *((volatile uint16_t*)(0x40042144UL))
#define FM_USB0_EP0OS                             *((volatile uint16_t*)(0x40042148UL))
#define FM0P_USB0_EP0OS                           *((volatile uint16_t*)(0x40042148UL))
#define FM_USB0_EP1S                              *((volatile uint16_t*)(0x4004214CUL))
#define FM0P_USB0_EP1S                            *((volatile uint16_t*)(0x4004214CUL))
#define FM_USB0_EP2S                              *((volatile uint16_t*)(0x40042150UL))
#define FM0P_USB0_EP2S                            *((volatile uint16_t*)(0x40042150UL))
#define FM_USB0_EP3S                              *((volatile uint16_t*)(0x40042154UL))
#define FM0P_USB0_EP3S                            *((volatile uint16_t*)(0x40042154UL))
#define FM_USB0_EP4S                              *((volatile uint16_t*)(0x40042158UL))
#define FM0P_USB0_EP4S                            *((volatile uint16_t*)(0x40042158UL))
#define FM_USB0_EP5S                              *((volatile uint16_t*)(0x4004215CUL))
#define FM0P_USB0_EP5S                            *((volatile uint16_t*)(0x4004215CUL))
#define FM_USB0_EP0DT                             *((volatile uint16_t*)(0x40042160UL))
#define FM0P_USB0_EP0DT                           *((volatile uint16_t*)(0x40042160UL))
#define FM_USB0_EP1DT                             *((volatile uint16_t*)(0x40042164UL))
#define FM0P_USB0_EP1DT                           *((volatile uint16_t*)(0x40042164UL))
#define FM_USB0_EP2DT                             *((volatile uint16_t*)(0x40042168UL))
#define FM0P_USB0_EP2DT                           *((volatile uint16_t*)(0x40042168UL))
#define FM_USB0_EP3DT                             *((volatile uint16_t*)(0x4004216CUL))
#define FM0P_USB0_EP3DT                           *((volatile uint16_t*)(0x4004216CUL))
#define FM_USB0_EP4DT                             *((volatile uint16_t*)(0x40042170UL))
#define FM0P_USB0_EP4DT                           *((volatile uint16_t*)(0x40042170UL))
#define FM_USB0_EP5DT                             *((volatile uint16_t*)(0x40042174UL))
#define FM0P_USB0_EP5DT                           *((volatile uint16_t*)(0x40042174UL))

