MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C31C0AGN20000/mcu.h
/*******************************************************************************
* I2CSLAVE Registers I2CSLAVE
*   Bitband Section
*******************************************************************************/
#define bFM_I2CSLAVE_IBSADR_SAEN                  *((volatile  uint8_t *)(0x426F309CUL))
#define bFM0P_I2CSLAVE_IBSADR_SAEN                *((volatile  uint8_t *)(0x426F309CUL))

#define bFM_I2CSLAVE_IBSCR_TIE                    *((volatile  uint8_t *)(0x426F3040UL))
#define bFM0P_I2CSLAVE_IBSCR_TIE                  *((volatile  uint8_t *)(0x426F3040UL))
#define bFM_I2CSLAVE_IBSCR_RIE                    *((volatile  uint8_t *)(0x426F3044UL))
#define bFM0P_I2CSLAVE_IBSCR_RIE                  *((volatile  uint8_t *)(0x426F3044UL))
#define bFM_I2CSLAVE_IBSCR_INTE                   *((volatile  uint8_t *)(0x426F3048UL))
#define bFM0P_I2CSLAVE_IBSCR_INTE                 *((volatile  uint8_t *)(0x426F3048UL))
#define bFM_I2CSLAVE_IBSCR_CNDE                   *((volatile  uint8_t *)(0x426F304CUL))
#define bFM0P_I2CSLAVE_IBSCR_CNDE                 *((volatile  uint8_t *)(0x426F304CUL))
#define bFM_I2CSLAVE_IBSCR_WSEL                   *((volatile  uint8_t *)(0x426F3050UL))
#define bFM0P_I2CSLAVE_IBSCR_WSEL                 *((volatile  uint8_t *)(0x426F3050UL))
#define bFM_I2CSLAVE_IBSCR_ACKE                   *((volatile  uint8_t *)(0x426F3054UL))
#define bFM0P_I2CSLAVE_IBSCR_ACKE                 *((volatile  uint8_t *)(0x426F3054UL))
#define bFM_I2CSLAVE_IBSCR_RSVEN                  *((volatile  uint8_t *)(0x426F305CUL))
#define bFM0P_I2CSLAVE_IBSCR_RSVEN                *((volatile  uint8_t *)(0x426F305CUL))

#define bFM_I2CSLAVE_IBSMSKR_EN                   *((volatile  uint8_t *)(0x426F30BCUL))
#define bFM0P_I2CSLAVE_IBSMSKR_EN                 *((volatile  uint8_t *)(0x426F30BCUL))

#define bFM_I2CSLAVE_IBSSCR_SPCC                  *((volatile  uint8_t *)(0x426F3204UL))
#define bFM0P_I2CSLAVE_IBSSCR_SPCC                *((volatile  uint8_t *)(0x426F3204UL))
#define bFM_I2CSLAVE_IBSSCR_RSCC                  *((volatile  uint8_t *)(0x426F3208UL))
#define bFM0P_I2CSLAVE_IBSSCR_RSCC                *((volatile  uint8_t *)(0x426F3208UL))
#define bFM_I2CSLAVE_IBSSCR_INTC                  *((volatile  uint8_t *)(0x426F3228UL))
#define bFM0P_I2CSLAVE_IBSSCR_INTC                *((volatile  uint8_t *)(0x426F3228UL))

#define bFM_I2CSLAVE_IBSSR_BB                     *((volatile  uint8_t *)(0x426F3000UL))
#define bFM0P_I2CSLAVE_IBSSR_BB                   *((volatile  uint8_t *)(0x426F3000UL))
#define bFM_I2CSLAVE_IBSSR_SPC                    *((volatile  uint8_t *)(0x426F3004UL))
#define bFM0P_I2CSLAVE_IBSSR_SPC                  *((volatile  uint8_t *)(0x426F3004UL))
#define bFM_I2CSLAVE_IBSSR_RSC                    *((volatile  uint8_t *)(0x426F3008UL))
#define bFM0P_I2CSLAVE_IBSSR_RSC                  *((volatile  uint8_t *)(0x426F3008UL))
#define bFM_I2CSLAVE_IBSSR_ACT                    *((volatile  uint8_t *)(0x426F300CUL))
#define bFM0P_I2CSLAVE_IBSSR_ACT                  *((volatile  uint8_t *)(0x426F300CUL))
#define bFM_I2CSLAVE_IBSSR_TRX                    *((volatile  uint8_t *)(0x426F3010UL))
#define bFM0P_I2CSLAVE_IBSSR_TRX                  *((volatile  uint8_t *)(0x426F3010UL))
#define bFM_I2CSLAVE_IBSSR_RSA                    *((volatile  uint8_t *)(0x426F3014UL))
#define bFM0P_I2CSLAVE_IBSSR_RSA                  *((volatile  uint8_t *)(0x426F3014UL))
#define bFM_I2CSLAVE_IBSSR_RACK                   *((volatile  uint8_t *)(0x426F3018UL))
#define bFM0P_I2CSLAVE_IBSSR_RACK                 *((volatile  uint8_t *)(0x426F3018UL))
#define bFM_I2CSLAVE_IBSSR_FBT                    *((volatile  uint8_t *)(0x426F301CUL))
#define bFM0P_I2CSLAVE_IBSSR_FBT                  *((volatile  uint8_t *)(0x426F301CUL))
#define bFM_I2CSLAVE_IBSSR_TDRE                   *((volatile  uint8_t *)(0x426F3020UL))
#define bFM0P_I2CSLAVE_IBSSR_TDRE                 *((volatile  uint8_t *)(0x426F3020UL))
#define bFM_I2CSLAVE_IBSSR_RDRF                   *((volatile  uint8_t *)(0x426F3024UL))
#define bFM0P_I2CSLAVE_IBSSR_RDRF                 *((volatile  uint8_t *)(0x426F3024UL))
#define bFM_I2CSLAVE_IBSSR_INT                    *((volatile  uint8_t *)(0x426F3028UL))
#define bFM0P_I2CSLAVE_IBSSR_INT                  *((volatile  uint8_t *)(0x426F3028UL))

#define bFM_I2CSLAVE_IBSSSR_TDRES                 *((volatile  uint8_t *)(0x426F32A0UL))
#define bFM0P_I2CSLAVE_IBSSSR_TDRES               *((volatile  uint8_t *)(0x426F32A0UL))


/*******************************************************************************
* INTREQ Registers INTREQ
*   Bitband Section
*******************************************************************************/
#define bFM_INTREQ_EXC02MON_NMI                   *((volatile  uint8_t *)(0x42624000UL))
#define bFM0P_INTREQ_EXC02MON_NMI                 *((volatile  uint8_t *)(0x42624000UL))
#define bFM_INTREQ_EXC02MON_HWINT                 *((volatile  uint8_t *)(0x42624004UL))
#define bFM0P_INTREQ_EXC02MON_HWINT               *((volatile  uint8_t *)(0x42624004UL))

#define bFM_INTREQ_IRQ00MON_INT0                  *((volatile  uint8_t *)(0x42624080UL))
#define bFM0P_INTREQ_IRQ00MON_INT0                *((volatile  uint8_t *)(0x42624080UL))
#define bFM_INTREQ_IRQ00MON_INT1                  *((volatile  uint8_t *)(0x42624084UL))
#define bFM0P_INTREQ_IRQ00MON_INT1                *((volatile  uint8_t *)(0x42624084UL))
#define bFM_INTREQ_IRQ00MON_INT2                  *((volatile  uint8_t *)(0x42624088UL))
#define bFM0P_INTREQ_IRQ00MON_INT2                *((volatile  uint8_t *)(0x42624088UL))

#define bFM_INTREQ_IRQ01MON_INT0                  *((volatile  uint8_t *)(0x42624100UL))
#define bFM0P_INTREQ_IRQ01MON_INT0                *((volatile  uint8_t *)(0x42624100UL))
#define bFM_INTREQ_IRQ01MON_INT1                  *((volatile  uint8_t *)(0x42624104UL))
#define bFM0P_INTREQ_IRQ01MON_INT1                *((volatile  uint8_t *)(0x42624104UL))
#define bFM_INTREQ_IRQ01MON_INT2                  *((volatile  uint8_t *)(0x42624108UL))
#define bFM0P_INTREQ_IRQ01MON_INT2                *((volatile  uint8_t *)(0x42624108UL))

#define bFM_INTREQ_IRQ02MON_INT0                  *((volatile  uint8_t *)(0x42624180UL))
#define bFM0P_INTREQ_IRQ02MON_INT0                *((volatile  uint8_t *)(0x42624180UL))
#define bFM_INTREQ_IRQ02MON_INT1                  *((volatile  uint8_t *)(0x42624184UL))
#define bFM0P_INTREQ_IRQ02MON_INT1                *((volatile  uint8_t *)(0x42624184UL))
#define bFM_INTREQ_IRQ02MON_INT2                  *((volatile  uint8_t *)(0x42624188UL))
#define bFM0P_INTREQ_IRQ02MON_INT2                *((volatile  uint8_t *)(0x42624188UL))

#define bFM_INTREQ_IRQ03MON_INT0                  *((volatile  uint8_t *)(0x42624200UL))
#define bFM0P_INTREQ_IRQ03MON_INT0                *((volatile  uint8_t *)(0x42624200UL))
#define bFM_INTREQ_IRQ03MON_INT1                  *((volatile  uint8_t *)(0x42624204UL))
#define bFM0P_INTREQ_IRQ03MON_INT1                *((volatile  uint8_t *)(0x42624204UL))
#define bFM_INTREQ_IRQ03MON_INT2                  *((volatile  uint8_t *)(0x42624208UL))
#define bFM0P_INTREQ_IRQ03MON_INT2                *((volatile  uint8_t *)(0x42624208UL))

